###################################################################

# Created by write_sdc on Tue Oct 22 00:06:33 2013

###################################################################
set sdc_version 1.2

set_max_transition 1 [current_design]
create_clock [get_ports clk]  -period 10  -waveform {0 5}
create_clock -name vclk  -period 10  -waveform {0 5}
set_clock_uncertainty -from vclk -to vclk 1
set_input_delay -clock vclk  5  [get_ports N1]
set_input_delay -clock vclk  5  [get_ports N5]
set_input_delay -clock vclk  5  [get_ports N9]
set_input_delay -clock vclk  5  [get_ports N13]
set_input_delay -clock vclk  5  [get_ports N17]
set_input_delay -clock vclk  5  [get_ports N21]
set_input_delay -clock vclk  5  [get_ports N25]
set_input_delay -clock vclk  5  [get_ports N29]
set_input_delay -clock vclk  5  [get_ports N33]
set_input_delay -clock vclk  5  [get_ports N37]
set_input_delay -clock vclk  5  [get_ports N41]
set_input_delay -clock vclk  5  [get_ports N45]
set_input_delay -clock vclk  5  [get_ports N49]
set_input_delay -clock vclk  5  [get_ports N53]
set_input_delay -clock vclk  5  [get_ports N57]
set_input_delay -clock vclk  5  [get_ports N61]
set_input_delay -clock vclk  5  [get_ports N65]
set_input_delay -clock vclk  5  [get_ports N69]
set_input_delay -clock vclk  5  [get_ports N73]
set_input_delay -clock vclk  5  [get_ports N77]
set_input_delay -clock vclk  5  [get_ports N81]
set_input_delay -clock vclk  5  [get_ports N85]
set_input_delay -clock vclk  5  [get_ports N89]
set_input_delay -clock vclk  5  [get_ports N93]
set_input_delay -clock vclk  5  [get_ports N97]
set_input_delay -clock vclk  5  [get_ports N101]
set_input_delay -clock vclk  5  [get_ports N105]
set_input_delay -clock vclk  5  [get_ports N109]
set_input_delay -clock vclk  5  [get_ports N113]
set_input_delay -clock vclk  5  [get_ports N117]
set_input_delay -clock vclk  5  [get_ports N121]
set_input_delay -clock vclk  5  [get_ports N125]
set_input_delay -clock vclk  5  [get_ports N129]
set_input_delay -clock vclk  5  [get_ports N130]
set_input_delay -clock vclk  5  [get_ports N131]
set_input_delay -clock vclk  5  [get_ports N132]
set_input_delay -clock vclk  5  [get_ports N133]
set_input_delay -clock vclk  5  [get_ports N134]
set_input_delay -clock vclk  5  [get_ports N135]
set_input_delay -clock vclk  5  [get_ports N136]
set_input_delay -clock vclk  5  [get_ports N137]
set_output_delay -clock vclk  5  [get_ports Qout_N724]
set_output_delay -clock vclk  5  [get_ports Qout_N725]
set_output_delay -clock vclk  5  [get_ports Qout_N726]
set_output_delay -clock vclk  5  [get_ports Qout_N727]
set_output_delay -clock vclk  5  [get_ports Qout_N728]
set_output_delay -clock vclk  5  [get_ports Qout_N729]
set_output_delay -clock vclk  5  [get_ports Qout_N730]
set_output_delay -clock vclk  5  [get_ports Qout_N731]
set_output_delay -clock vclk  5  [get_ports Qout_N732]
set_output_delay -clock vclk  5  [get_ports Qout_N733]
set_output_delay -clock vclk  5  [get_ports Qout_N734]
set_output_delay -clock vclk  5  [get_ports Qout_N735]
set_output_delay -clock vclk  5  [get_ports Qout_N736]
set_output_delay -clock vclk  5  [get_ports Qout_N737]
set_output_delay -clock vclk  5  [get_ports Qout_N738]
set_output_delay -clock vclk  5  [get_ports Qout_N739]
set_output_delay -clock vclk  5  [get_ports Qout_N740]
set_output_delay -clock vclk  5  [get_ports Qout_N741]
set_output_delay -clock vclk  5  [get_ports Qout_N742]
set_output_delay -clock vclk  5  [get_ports Qout_N743]
set_output_delay -clock vclk  5  [get_ports Qout_N744]
set_output_delay -clock vclk  5  [get_ports Qout_N745]
set_output_delay -clock vclk  5  [get_ports Qout_N746]
set_output_delay -clock vclk  5  [get_ports Qout_N747]
set_output_delay -clock vclk  5  [get_ports Qout_N748]
set_output_delay -clock vclk  5  [get_ports Qout_N749]
set_output_delay -clock vclk  5  [get_ports Qout_N750]
set_output_delay -clock vclk  5  [get_ports Qout_N751]
set_output_delay -clock vclk  5  [get_ports Qout_N752]
set_output_delay -clock vclk  5  [get_ports Qout_N753]
set_output_delay -clock vclk  5  [get_ports Qout_N754]
set_output_delay -clock vclk  5  [get_ports Qout_N755]
